//============================================================
//
//	ローディングヘッダー [loading.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _LOADING_H_
#define _LOADING_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include <thread>

//************************************************************
//	前方宣言
//************************************************************
class CAnim2D;	// アニメーション2Dクラス

//************************************************************
//	クラス定義
//************************************************************
// ローディングクラス
class CLoading
{
public:
	// ローディング状態列挙
	enum ELoading
	{
		LOAD_NONE = 0,	// 何もしていない状態
		LOAD_UPDATE,	// ロード更新状態
		LOAD_END,		// ロード終了状態
		LOAD_MAX		// この列挙型の総数
	};

	// コンストラクタ
	CLoading();

	// デストラクタ
	~CLoading();

	// 初期化関数ポインタ型エイリアス定義
	typedef HRESULT(*AFuncInit)(void);

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Set(AFuncInit *pFuncInit);	// ロード設定
	ELoading GetState(void) const;	// ロード状態取得

	// 静的メンバ関数
	static CLoading *Create(void);				// 生成
	static void Release(CLoading *&pLoading);	// 破棄

	std::thread m_funcInit;	// 初期化処理スレッド

private:
	// メンバ変数
	CAnim2D *m_pLoad;		// ロード画面情報
	ELoading m_stateLoad;	// ロード状態
};

#endif	// _LOADING_H_
