//============================================================
//
//	エディット当たり判定ヘッダー [editColl.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _EDIT_COLL_H_
#define _EDIT_COLL_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "edit.h"

//************************************************************
//	クラス定義
//************************************************************
// エディット当たり判定クラス
class CEditColl : public CEdit
{
public:
	// コンストラクタ
	CEditColl();

	// デストラクタ
	~CEditColl();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(void) override;		// 更新
	void Draw(void) override;		// 描画
};

#endif	// _EDIT_COLL_H_
